 [0] => Array
        (
            [taid] => 1
            [taname] => 袖长
            [tavalue] => Array
                (
                    [0] => 无袖
                    [1] => 短袖
                    [2] => 长袖
                    [3] => 五分袖/中袖
                    [4] => 七分袖
                    [5] => 九分袖
                )

            [class] => 0
            [tid] => 1
        )

    [1] => Array
        (
            [taid] => 2
            [taname] => 款式
            [tavalue] => Array
                (
                    [0] => 直筒型
                    [1] => 修身型
                    [2] => 宽松型
                    [3] => 蝙蝠型
                    [4] => 斗篷型
                    [5] => 高腰型
                    [6] => 裙摆型
                    [7] => 不规则型
                )

            [class] => 0
            [tid] => 1
        )

    [2] => Array
        (
            [taid] => 3
            [taname] => 衣长
            [tavalue] => Array
                (
                    [0] => 超短
                    [1] => 短款
                    [2] => 中长
                    [3] => 长款
                    [4] => 加长款
                )

            [class] => 0
            [tid] => 1
        )

    [3] => Array
        (
            [taid] => 4
            [taname] => 袖型
            [tavalue] => Array
                (
                    [0] => 常规袖
                    [1] => 泡泡袖
                    [2] => 蝙蝠袖
                    [3] => 露肩袖
                    [4] => 荷叶袖
                    [5] => 灯笼袖
                    [6] => 喇叭袖
                    [7] => 耸肩
                    [8] => 堆堆袖
                    [9] => 衬衫袖
                    [10] => 花瓣袖
                )

            [class] => 0
            [tid] => 1
        )

    [4] => Array
        (
            [taid] => 5
            [taname] => 领型
            [tavalue] => Array
                (
                    [0] => 圆领
                    [1] => V领
                    [2] => 一字领
                    [3] => 翻领
                    [4] => 立领